let form = document.querySelector('#dialog__form');
let input = document.querySelector('#dialog__input');
let button = document.querySelector('#dialog__button');
let messanger = document.querySelector('#dialog__messanger');

form.addEventListener('submit', handleForm);

function handleForm() {
	if (input.value != '') {
		messanger.innerHTML += `<div class="dialog__message question">${input.value}</div>`;
		let [answer, photo] = getAnswer(input.value);
		messanger.innerHTML += `<div class="dialog__message answer">${answer}</div>`;
		photo.forEach(element => {
			messanger.innerHTML += element;
		});
		messanger.scrollTop = 99999;

		speechSynthesis.speak(new SpeechSynthesisUtterance(answer)); // new audio
		// old audio
		/*messanger.innerHTML +=
			"<audio src='https://distrib.belstu.by/yandex-tts-bridge/?text=" +
			answer +
			"'></audio>";
		if (messanger.lastChild.tagName == 'AUDIO') {
			messanger.lastChild.play();
		}*/
	}
	input.value = '';
}

input.addEventListener('click', inputClick, false);

function inputClick() {
	speechSynthesis.pause();
}

button.addEventListener('mouseover', buttonOver, false);
button.addEventListener('mouseout', buttonOut, false);
button.addEventListener('click', buttonClick, false);

function buttonOver() {
	button.classList.add('dialog__button-hover');
}

function buttonOut() {
	button.classList.remove('dialog__button-hover');
}

function buttonClick() {
	button.classList.add('dialog__button-listen');

	speechSynthesis.pause();

	let recognizer = new webkitSpeechRecognition();
	recognizer.interimResults = true;
	recognizer.lang = 'ru-Ru';
	recognizer.on;
	recognizer.onresult = function (event) {
		let result = event.results[event.resultIndex];
		if (result.isFinal) {
			input.value = result[0].transcript;
			button.classList.remove('dialog__button-listen');
			handleForm();
		} else {
			input.value = result[0].transcript;
		}
	};
	recognizer.onaudioend = function (event) {
		button.classList.remove('dialog__button-listen');
	};
	recognizer.start();
}

let knowledge = [
	[
		'гамма-излучение',
		'- это',
		' коротковолновое электромагнитное излучение с чрезвычайно малой длиной волны (0.1 нм).  Это излучение имеет квантовый характер, т.е. испускается и распространяется в среде и поглощается веществом в виде отдельных дискретных квантов-фотонов.',
	],
	[
		'установка лабораторной работы',
		'Работает',
		"<p>таким образом: </p><video src='videos/second_animation.mov' width='200' controls></video>",
	],
	[
		'гамма-квант',
		'- это',
		'фотон с энергией больше 100 кэВ.',
	],
	[
		'фотоэффект',
		'- это',
		'процесс поглощения гамма-кванта атомным (связанным) электроном, при котором электрон покидает пределы атома.',
	],
	[
		'фотоэлектрон',
		'- это',
		'электрон, поглощающий гамма-квант, при этом покидающий пределы атома.',
	],
	[
		'электрон',
		'- это',
		'стабильная отрицательно заряженная элементарная частица.',
	],
	[
		'атом',
		'- это',
		'частица вещества микроскопических размеров и массы, наименьшая часть химического элемента, являющаяся носителем его свойств.',
	],
	[
		'гамма-радиометр',
		' - это ',
		'прибор, предназначенный для измерения суммарной удельной (объемной или массовой) активности радионуклидов цезия-134 (134Cs) и цезия-137 (137Cs), калий-40 (40K), в загрязненных радионуклидами пробах, в частности, продуктах питания.',
	],
	[
		'экстремум функции',
		'- это',
		'максимальное или минимальное значение функции.',
	],
	[
		'эффект Комптона',
		'- это',
		'эффект при котором в результате упругого столкновения с внешним (валентным) электроном гамма-квант передает ему часть своей энергии (электрон отдачи) и отклоняется от первоначального направления распространения, а остальная часть энергии передается вторичному (рассеянному) гамма-кванту. Этот процесс протекает при любых энергиях гамма-квантов, но преимущественно с энергией от 0,2 до 1 МэВ.',
	],
	[
		'Комптоновское рассеяние',
		'- это',
		'эффект при котором в результате упругого столкновения с внешним (валентным) электроном гамма-квант передает ему часть своей энергии (электрон отдачи) и отклоняется от первоначального направления распространения, а остальная часть энергии передается вторичному (рассеянному) гамма-кванту. Этот процесс протекает при любых энергиях гамма-квантов, но преимущественно с энергией от 0,2 до 1 МэВ.',
	],
	[
		'эффект комптона',
		'- это',
		'эффект при котором в результате упругого столкновения с внешним (валентным) электроном гамма-квант передает ему часть своей энергии (электрон отдачи) и отклоняется от первоначального направления распространения, а остальная часть энергии передается вторичному (рассеянному) гамма-кванту. Этот процесс протекает при любых энергиях гамма-квантов, но преимущественно с энергией от 0,2 до 1 МэВ.',
	],
	[
		'комптоновское рассеяние',
		'- это',
		'эффект при котором в результате упругого столкновения с внешним (валентным) электроном гамма-квант передает ему часть своей энергии (электрон отдачи) и отклоняется от первоначального направления распространения, а остальная часть энергии передается вторичному (рассеянному) гамма-кванту. Этот процесс протекает при любых энергиях гамма-квантов, но преимущественно с энергией от 0,2 до 1 МэВ.',
	],
	[
		'образование электронно-позитронных пар',
		'- это',
		'Это процесс взаимодействия фотонов с веществом, при котором энергия фотона в электрическом поле ядра (на расстояниях порядка 10^–13 м) или электрона переходит в энергию массы покоя электрона е- и позитронае e+',
	],
	[
		'узкий пучок фотонов',
		'-',
		'означает в данном случае то, что любое взаимодействие фотона с веществом выводит его из пучка.',
	],
	[
		'линейный коэффициент ослабления',
		'-',
		'характеризует процесс прохождения фотонного излучения через вещество. Этот коэффициент зависит от свойств среды и энергии фотонов. В этом случае каждый акт взаимодействия фотона с атомом или электроном, независимо от того, произошло поглощение или рассеяние фотона, приводит к выводу фотона из пучка.',
	],
	[
		'радиационная безопасность',
		'- это',
		'состояние защищенности настоящего и будущего поколений людей от вредного для их здоровья воздействия ионизирующего излучения.',
	],
	[
		'массовый коэффициент ослабления',
		'-',
		'характеризует уменьшение интенсивности рентгеновских лучей в единице массы вещества, а произведение ρdx представляет собой поверхностную плотность вещества.',
	],
	[
		'1 электронвольт',
		'- это',
		'внесистемная единица энергии, используемая в атомной и ядерной физике, в физике элементарных частиц и в близких и родственных областях науки. Один электронвольт равен энергии, необходимой для переноса элементарного заряда в электростатическом поле между точками с разницей потенциалов в 1 В.',
	],
	[
		'элементарный заряд',
		'- это',
		'фундаментальная физическая постоянная, минимальная порция (квант) электрического заряда, наблюдающегося в природе у свободных долгоживущих частиц. Согласно изменениям определений основных единиц СИ равен точно 1,602 176 634⋅10^-19 Кл в Международной системе единиц (СИ). Тесно связан с постоянной тонкой структуры, описывающей электромагнитное взаимодействие. ',
	],
	[
		'закон Бугера',
		'- это',
		'физический закон, определяющий ослабление параллельного монохроматического пучка света при распространении его в поглощающей среде.',
	],
	[
		'закон бугера',
		'- это',
		'физический закон, определяющий ослабление параллельного монохроматического пучка света при распространении его в поглощающей среде.',
	],
	[
		'Бугер',
		'- это',
		'<p>французский физик и астроном, основатель фотометрии. Известен трудами по теории корабля, геодезии, гидрографии и другим отраслям знания. Имя Бугера внесено в список 72 величайших учёных Франции, размещённый на первом этаже Эйфелевой башни.<img class="dialog__image" src="images/Bouguer.jpg"/></p>',
	],
	[
		'Комптон',
		'- это',
		'<p>американский физик, лауреат Нобелевской премии по физике 1927 года. Член Национальной академии наук США (1927).<img class="dialog__image" src="images/Compton.jpg"/></p>',
	],
	[
		'бугер',
		'- это',
		'<p>французский физик и астроном, основатель фотометрии. Известен трудами по теории корабля, геодезии, гидрографии и другим отраслям знания. Имя Бугера внесено в список 72 величайших учёных Франции, размещённый на первом этаже Эйфелевой башни.<img class="dialog__image" src="images/Bouguer.jpg"/></p>',
	],
	[
		'комптон',
		'- это',
		'<p>американский физик, лауреат Нобелевской премии по физике 1927 года. Член Национальной академии наук США (1927).<img class="dialog__image" src="images/Compton.jpg"/></p>',
	],
	[
		'БЖЧ',
		'- это',
		"1) благоприятное, нормальное состояние окружающей человека среды, условий труда и учёбы, питания и отдыха, при которых снижена возможность возникновения опасных факторов, угрожающих его здоровью, жизни, имуществу, законным интересам; 2) наука о безопасном взаимодействии человека с окружающей средой; 3) учебная дисциплина в системе среднего профессионального и высшего образования, формирующая знания, умения и навыки обеспечения собственной безопасности, действий в условиях опасных, в том числе чрезвычайных ситуаций.",
	],
	[
		'Безопасность жизнедеятельности человека',
		'- это',
		"1) благоприятное, нормальное состояние окружающей человека среды, условий труда и учёбы, питания и отдыха, при которых снижена возможность возникновения опасных факторов, угрожающих его здоровью, жизни, имуществу, законным интересам; 2) наука о безопасном взаимодействии человека с окружающей средой; 3) учебная дисциплина в системе среднего профессионального и высшего образования, формирующая знания, умения и навыки обеспечения собственной безопасности, действий в условиях опасных, в том числе чрезвычайных ситуаций.",
	],
	[
		'безопасность жизнедеятельности человека',
		'- это',
		"1) благоприятное, нормальное состояние окружающей человека среды, условий труда и учёбы, питания и отдыха, при которых снижена возможность возникновения опасных факторов, угрожающих его здоровью, жизни, имуществу, законным интересам; 2) наука о безопасном взаимодействии человека с окружающей средой; 3) учебная дисциплина в системе среднего профессионального и высшего образования, формирующая знания, умения и навыки обеспечения собственной безопасности, действий в условиях опасных, в том числе чрезвычайных ситуаций.",
	],
	[
		'ЧС',
		'- это',
		"обстановка на определённой территории, сложившаяся в результате аварии, опасного природного явления, катастрофы, стихийного или иного бедствия, которые могут повлечь или повлекли за собой человеческие жертвы, ущерб здоровью людей или окружающей среде, значительные материальные потери и нарушение условий жизнедеятельности людей.",
	],
	[
		'Чрезвычайная ситуация',
		'- это',
		"обстановка на определённой территории, сложившаяся в результате аварии, опасного природного явления, катастрофы, стихийного или иного бедствия, которые могут повлечь или повлекли за собой человеческие жертвы, ущерб здоровью людей или окружающей среде, значительные материальные потери и нарушение условий жизнедеятельности людей.",
	],
	[
		'чрезвычайная ситуация',
		'- это',
		"обстановка на определённой территории, сложившаяся в результате аварии, опасного природного явления, катастрофы, стихийного или иного бедствия, которые могут повлечь или повлекли за собой человеческие жертвы, ущерб здоровью людей или окружающей среде, значительные материальные потери и нарушение условий жизнедеятельности людей.",
	],
	[
		'радиационная обстановка',
		'-',
		'под радиационной обстановкой понимают совокупность последствий радиоактивного загрязнения местности, оказывающих влияние на деятельность хозяйственных объектов, сил гражданской обороны (МЧС) и населения.',
	],
	[
		'1 вольт',
		'- это',
		"<p>в Международной системе единиц (СИ) единица измерения электрического потенциала, разности потенциалов, электрического напряжения и электродвижущей силы. Названа в честь итальянского физика и физиолога Алессандро Вольты</p><img src='Index_files/image/220px-Alessandro_Volta.jpeg'/><p>Алессандро Вольта</p>",
	],
	[
		'гамма-излучение',
		'- это',
		'вид электромагнитного излучения, характеризующийся чрезвычайно малой длиной волны и, вследствие этого, ярко выраженными корпускулярными и слабо выраженными волновыми свойствами. Относится к ионизирующим излучениям, то есть к излучениям, взаимодействие которых с веществом способно приводить к образованию ионов разных знаков.',
	],
	[
		'свинец',
		'- это',
		'элемент 14-й группы, шестого периода периодической системы химических элементов Д. И. Менделеева, с атомным номером 82 и, таким образом, содержит магическое число протонов. Простое вещество свинец — ковкий, сравнительно легкоплавкий тяжёлый металл серебристо-белого цвета с синеватым отливом. Плотность свинца — 11,35 г/см³. Свинец токсичен. Известен с глубокой древности.',
	],
	[
		'медь',
		'- это',
		' химический элемент 11-й группы четвёртого периода периодической системы химических элементов Д. И. Менделеева, с атомным номером 29. В виде простого вещества, медь — это пластичный переходный металл золотисто-розового цвета (розового цвета при отсутствии оксидной плёнки). C давних пор широко используется человеком',
	],
	[
		'Менделеев',
		'выглядит',
		"<p>как на фото:</p><img class='dialog__image' src='images/Mendeleev.jpg'/>",
	],
	[
		'менделеев',
		'выглядит',
		"<p>как на фото:</p><img class='dialog__image' src='images/Mendeleev.jpg'/>",
	],
	[
		'магические числа',
		'- это',
		'натуральные числа, соответствующие количеству нуклонов в атомном ядре, при котором становится полностью заполненной какая-либо его оболочка.',
	],
	[
		'Радиоактивный распад',
		'- это',
		'спонтанное изменение состава (заряда Z, массового числа A) или внутреннего строения нестабильных атомных ядер путём испускания элементарных частиц, гамма-квантов и/или ядерных фрагментов. Процесс радиоактивного распада также называют радиоактивностью, а соответствующие нуклиды — радиоактивными (радионуклидами). Радиоактивными называют также вещества, содержащие радиоактивные ядра.',
	],
	[
		'радиоактивный распад',
		'- это',
		'спонтанное изменение состава (заряда Z, массового числа A) или внутреннего строения нестабильных атомных ядер путём испускания элементарных частиц, гамма-квантов и/или ядерных фрагментов. Процесс радиоактивного распада также называют радиоактивностью, а соответствующие нуклиды — радиоактивными (радионуклидами). Радиоактивными называют также вещества, содержащие радиоактивные ядра.',
	],
	[
		'Радиоактивность',
		'- это',
		'спонтанное изменение состава (заряда Z, массового числа A) или внутреннего строения нестабильных атомных ядер путём испускания элементарных частиц, гамма-квантов и/или ядерных фрагментов. Процесс радиоактивного распада также называют радиоактивным распадом, а соответствующие нуклиды — радиоактивными (радионуклидами). Радиоактивными называют также вещества, содержащие радиоактивные ядра.',
	],
	[
		'радиоактивность',
		'- это',
		'спонтанное изменение состава (заряда Z, массового числа A) или внутреннего строения нестабильных атомных ядер путём испускания элементарных частиц, гамма-квантов и/или ядерных фрагментов. Процесс радиоактивного распада также называют радиоактивным распадом, а соответствующие нуклиды — радиоактивными (радионуклидами). Радиоактивными называют также вещества, содержащие радиоактивные ядра.',
	],
	[
		'радионуклиды',
		'- это',
		'нуклиды, ядра которых нестабильны и испытывают радиоактивный распад.',
	],
	[
		'Радионуклиды',
		'- это',
		'нуклиды, ядра которых нестабильны и испытывают радиоактивный распад.',
	],
	[
		'цель работы',
		'звучит',
		'как: изучение механизмов взаимодействия гамма-излучения с веществом; проверка закона ослабления потока гамма-квантов, проходящего через поглотитель; определение массового коэффициента ослабления вещества и энергии гамма-квантов радиоактивного источника.',
	],
	[
		'установка',
		'выглядит',
		"как на фото:<img src='images/adani.jpg'/>",
	],
	[
		'гамма-квант',
		'выглядит',
		"<p>как на фото</p>:<img width='50%' src='images/simulator5.png'/>",
	],
	[
		'Цель работы',
		'звучит',
		'как: изучение механизмов взаимодействия гамма-излучения с веществом; проверка закона ослабления потока гамма-квантов, проходящего через поглотитель; определение массового коэффициента ослабления вещества и энергии гамма-квантов радиоактивного источника.',
	],
	[
		'Обрудование работы',
		'включает',
		'в себя: гамма-радиометр, гамма-квант, медные пластины, свинцовые пластины.',
	],
	[
		'Линейная плотность ионизации',
		'- это',
		'число пар ионов, образующихся в месте прохождения заряженной частицы из расчёта на единицу её пробега в среде; используется для характеристики ионизирующего излучения.',
	],
	[
		'массовый коэффициент ослабления',
		'измеряется',
		'в см^2/г или м^2/кг'
	],
	[
		'линейный коэффициент ослабления',
		'измеряется',
		'в см^-1'
	],
	[
		'линейная плотность ионизации',
		'- это',
		'число пар ионов, образующихся в месте прохождения заряженной частицы из расчёта на единицу её пробега в среде; используется для характеристики ионизирующего излучения.',
	],
	[
		'ЛПИ',
		'- это',
		'число пар ионов, образующихся в месте прохождения заряженной частицы из расчёта на единицу её пробега в среде; используется для характеристики ионизирующего излучения.',
	],
	[
		'обрудование работы',
		'включает',
		'в себя: гамма-радиометр, гамма-квант, медные пластины, свинцовые пластины.',
	],
];

// псевдоокончания сказуемых (глаголов, кратких причастий и прилагательных )
let endings = [
	['ет', '(ет|ут|ют)'],
	['ут', '(ет|ут|ют)'],
	['ют', '(ет|ут|ют)'], // 1 спряжение
	['ит', '(ит|ат|ят)'],
	['ат', '(ит|ат|ят)'],
	['ят', '(ит|ат|ят)'], // 2 спряжение
	['ется', '(ет|ут|ют)ся'],
	['утся', '(ет|ут|ют)ся'],
	['ются', '(ет|ут|ют)ся'], // 1 спряжение, возвратные
	['ится', '(ит|ат|ят)ся'],
	['атся', '(ит|ат|ят)ся'],
	['ятся', '(ит|ат|ят)ся'], // 2 спряжение, возвратные
	['ен', 'ен'],
	['ена', 'ена'],
	['ено', 'ено'],
	['ены', 'ены'], // краткие прилагательные
	['ан', 'ан'],
	['ана', 'ана'],
	['ано', 'ано'],
	['аны', 'аны'], // краткие прилагательные
	['жен', 'жен'],
	['жна', 'жна'],
	['жно', 'жно'],
	['жны', 'жны'], // краткие прилагательные
	['такое', '- это'],
]; // для вопроса "что такое X?" ответ - "X - это ..."

// черный список слов, распознаваемых как сказуемые по ошибке
let blacklist = [
	'замена',
	'замены',
	'атрибут',
	'маршрут',
	'член',
	'нет',
];

function getEnding(word) {
	// проверка по черному списку
	if (blacklist.indexOf(word) !== -1) return -1;
	// перебор псевдоокончаний
	for (let j = 0; j < endings.length; j++) {
		// проверка, оканчивается ли i-ое слово на j-ое псевдоокончание
		if (word.substring(word.length - endings[j][0].length) == endings[j][0]) {
			return j; // возврат номера псевдоокончания
		}
	}
	return -1;
}

// функция, которая делает первую букву большой
function big1(str) {
	return str[0].toUpperCase() + str.slice(1);
}

// главная функция, обрабатывающая запросы клиентов
function getAnswer(question) {
	txt = question.toLowerCase().replace(/[*_#?\'",.!()[\]\\/]/g, '');
	// массив слов и знаков препинания
	let words = txt.split(' ');
	// флаг, найден ли ответ
	let result = false;
	// формируемый функцией ответ на вопрос
	let answer = [];
	answer[0] = '';
	answer[1] = new Array([]);
	// перебор слов
	for (let i = 0; i < words.length; i++) {
		// поиск номера псевдоокончания
		let ending = getEnding(words[i]);

		// если псевдоокончание найдено – это сказуемое, подлежащее в вопросе после него
		if (ending >= 0) {
			// ТОЧНЫЙ ПОИСК
			let subject_array = words.slice(i + 1);
			let subject_text = subject_array.join(' ');
			for (let j = 0; j < knowledge.length; j++)
				if (
					((words[i] == knowledge[j][1] || // точное совпадение сказуемого
						words[i].substring(0, words[i].length - endings[ending][0].length) +
							endings[ending][1] ==
							knowledge[j][1]) && // совпадение сказуемого с подстановкой (такое ->- это)
						subject_text == knowledge[j][0]) ||
					subject_text == knowledge[j][2]
				) {
					// совпадение подлежащего
					// создание простого предложения из семантической связи
					answer[0] += big1(
						knowledge[j][0] +
							' ' +
							knowledge[j][1] +
							' ' +
							knowledge[j][2] +
							'.<br/>'
					);
					if (knowledge[j][3]) answer[1].push(knowledge[j][3]);
					result = true;
				}
			if (result == false) {
				// ПОИСК С ПОМОЩЬЮ РЕГУЛЯРНЫХ ВЫРАЖЕНИЙ
				// замена псевдоокончания на набор возможных окончаний
				words[i] =
					words[i].substring(0, words[i].length - endings[ending][0].length) +
					endings[ending][1];
				// создание регулярного выражения для поиска по сказуемому из вопроса
				let predicate = new RegExp(words[i]);
				// для кратких прилагательных захватываем следующее слово
				if (endings[ending][0] == endings[ending][1]) {
					predicate = new RegExp(words[i] + ' ' + words[i + 1]);
					i++;
				}
				let subject_array = words.slice(i + 1);
				// создание регулярного выражения для поиска по подлежащему из вопроса
				// из слов подлежащего выбрасываем короткие предлоги (периметр у квадрата = периметр квадрата)
				for (let j = 0; j < subject_array.length; j++) {
					if (subject_array[j].length < 3) {
						subject_array.splice(j);
						j--;
					}
				}
				let subject_string = subject_array.join('.*');
				// только если в послежащем больше трех символов
				if (subject_string.length > 3) {
					let subject = new RegExp('.*' + subject_string + '.*');
					// поиск совпадений с шаблонами среди связей семантической сети
					for (let j = 0; j < knowledge.length; j++) {
						if (
							predicate.test(knowledge[j][1]) &&
							(subject.test(knowledge[j][0]) || subject.test(knowledge[j][2]))
						) {
							// создание простого предложения из семантической связи
							answer[0] += big1(
								knowledge[j][0] +
									' ' +
									knowledge[j][1] +
									' ' +
									knowledge[j][2] +
									'.<br/>'
							);
							if (knowledge[j][3]) answer[1].push(knowledge[j][3]);
							result = true;
						}
					}
					// если совпадений с двумя шаблонами нет
					if (result == false) {
						// поиск совпадений только с шаблоном подлежащего
						for (let j = 0; j < knowledge.length; j++) {
							if (
								subject.test(knowledge[j][0]) ||
								subject.test(knowledge[j][2])
							) {
								// создание простого предложения из семантической связи
								answer[0] += big1(
									knowledge[j][0] +
										' ' +
										knowledge[j][1] +
										' ' +
										knowledge[j][2] +
										'.<br/>'
								);
								if (knowledge[j][3]) answer[1].push(knowledge[j][3]);
								result = true;
							}
						}
					}
				}
			}
		}
	}
	if (!result) answer[0] = 'Ответ не найден';
	return answer;
}
